families = {
    ("Сидоров", "Никита"): 35,
    ("Сидорова", "Алина"): 34,
    ("Сидоров", "Павел"): 10,
    ("Иванов", "Вячеслав"): 32,
    ("Иванова", "Арсения"): 29,
    ("Иванов", "Егор"): 14,
    ("Фомин", "Никита"): 28,
    ("Фомина", "Алена"): 25,
    ("Фомин", "Владислав"): 11,
    ("Никулин", "Владимир"): 41,
    ("Никулина", "Анастасия"): 36,
    ("Никулин", "Артур"): 19
}

surname = input("Введите фамилию: ").title()

print()
for i_name, i_age in families.items():
    if surname in i_name or surname + "а" in i_name or surname[:-1] in i_name:
        print(i_name[0], i_name[1], i_age)

# зачтено
